app/views/users/index.html.erb

SELECT "photos".* FROM "photos" INNER JOIN "tags" ON "photos"."id" = "tags"."photo_id" WHERE "tags"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 1]]
---
  <h5>Contributor: <%= link_to user.name, user_path(user) %></h5>
 <% if user.photos.count > 0 %>