app/views/users/show.html.erb


 <% @user.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 1]]


   <% if @user.tags.count >= 1 %>
      <h3>Photos People Have Tagged Me In: </h3>
       <% @user.tags.each do |tag| %> <%#note: "tags" can be done in more straightforward way that "favorites have been done" (defining @tags in the users controller show action). Here, a separate method in the Tag model is used, to show different ways of approaching. %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."user_id" = $1  [["user_id", 2]]
SELECT COUNT(*) FROM "tags" WHERE "tags"."user_id" = $1  [["user_id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 2]]