app/views/photos/show.html.erb

    <h4> Tag people you see in this photo:
     <%= f.collection_select :user_id, User.all, :id, :name %>
---
SELECT "users".* FROM "users"