app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "photo_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 2], ["photo_id", 6]]
---
  def create
      @favorite = Favorite.new(favorite_params)
      if @favorite.save