app/controllers/photos_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    @photo = current_user.photos.build  #this method (and the photos.build in create) makes it so that whenever a user creates a photo, it is automatically added to their profile (even if hit "add photo" while viewing another's profile)
    @user = User.find(params[:user_id]) #another method would be to set this to current_user

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "photos" ("description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @photo = current_user.photos.build(photo_params)
    @user = User.find(params[:user_id])#another method would be to set this to current_user
     if @photo.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @user = User.find(params[:user_id])
    @photo = Photo.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 17]]
---
  def edit
    if User.find(params[:user_id]) != current_user
      flash[:notice] = "You are not permitted to edit this photo"
      redirect_to root_path
    else
      @user = current_user
      @photo = Photo.find(params[:id])

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 19]]
UPDATE "photos" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "user_id" = $4, "updated_at" = $5 WHERE "photos"."id" = $6  [["image_file_name", "Floor.jpg"], ["image_file_size", 547799], ["image_updated_at", "2015-02-10 15:23:17.113218"], ["user_id", 1], ["updated_at", "2015-02-10 15:23:18.393501"], ["id", 19]]
---
  def update
    @photo = Photo.find(params[:id])
    @photo.update(photo_params)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 17]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 17]]
---
 def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy