app/controllers/tags_controller.rb

INSERT INTO "tags" ("user_id", "photo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["photo_id", 1], ["created_at", "2015-02-07 17:11:17.546544"], ["updated_at", "2015-02-07 17:11:17.546544"]]
---
  def create
    @tag = Tag.new(tag_params)
    if @tag.save