app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def index
    @users = User.all
    user_id = session[:user_id]
    @user = User.where({:id => user_id}).first

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @favorites = Favorite.where(:user_id => @user.id)